performance.yml
config:
  target: "https://api.todoist.com/rest/v1"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Phase 1"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
scenarios:
  - flow:
      - get:
          url: "/tasks"
      - post:
          url: "/tasks"
          json:
            content: "Pollo de limon"
          capture:
            json: "$.id"
            as: "id"
      - log: "Current task id is {{ id }}"
      - get:
          url: "/tasks/{{ id }}" 
      - post:
          url: "/tasks/{{ id }}"
          json:
            content: "Pollo de sandia"
      - post:
          url: "/tasks/{{ id }}/close"
      - post:
          url: "/tasks/{{ id }}/reopen"
      - delete: 
          url: "/tasks/{{ id }}"